In [1]:
import numpy as np
import pandas as pd

In [ ]:
# pd.pivot_table() ---> used to get agg functions
# pd.crosstab(). ---> used to get counts of something happning

### Pivot Tables

In [2]:
data = {
    'Date': pd.date_range('2023-01-01', periods=20),
    'Product': ['A', 'B', 'C', 'D'] * 5,
    'Region': ['East', 'West', 'North', 'South', 'East', 'West', 'North', 'South', 'East', 'West',
               'North', 'South', 'East', 'West', 'North', 'South', 'East', 'West', 'North', 'South'],
    'Sales': np.random.randint(100, 1000, 20),
    'Units': np.random.randint(10, 100, 20),
    'Rep': ['John', 'Mary', 'Bob', 'Alice', 'John', 'Mary', 'Bob', 'Alice', 'John', 'Mary',
            'Bob', 'Alice', 'John', 'Mary', 'Bob', 'Alice', 'John', 'Mary', 'Bob', 'Alice']
}

df = pd.DataFrame(data)

df['Month'] = df['Date'].dt.month_name()
df['Quarter'] = 'Q' + df['Date'].dt.quarter.astype(str)
df

         Date Product Region  Sales  Units    Rep    Month Quarter
0  2023-01-01       A   East    499     68   John  January      Q1
1  2023-01-02       B   West    897     77   Mary  January      Q1
2  2023-01-03       C  North    637     66    Bob  January      Q1
3  2023-01-04       D  South    841     82  Alice  January      Q1
4  2023-01-05       A   East    791     42   John  January      Q1
5  2023-01-06       B   West    595     68   Mary  January      Q1
6  2023-01-07       C  North    553     28    Bob  January      Q1
7  2023-01-08       D  South    857     82  Alice  January      Q1
8  2023-01-09       A   East    169     71   John  January      Q1
9  2023-01-10       B   West    813     66   Mary  January      Q1
10 2023-01-11       C  North    955     95    Bob  January      Q1
11 2023-01-12       D  South    909     18  Alice  January      Q1
12 2023-01-13       A   East    826     79   John  January      Q1
13 2023-01-14       B   West    278     40   Mary  January      Q1
14 2023-01-15       C  North    638     21    Bob  January      Q1
15 2023-01-16       D  South    568     86  Alice  January      Q1
16 2023-01-17       A   East    850     36   John  January      Q1
17 2023-01-18       B   West    422     16   Mary  January      Q1
18 2023-01-19       C  North    796     47    Bob  January      Q1
19 2023-01-20       D  South    748     37  Alice  January      Q1

In [3]:
pd.pivot_table(df,values = 'Sales' , index = 'Region' , columns = 'Product')

Product      A      B      C      D
Region
East     627.0    NaN    NaN    NaN
North      NaN    NaN  715.8    NaN
South      NaN    NaN    NaN  784.6
West       NaN  601.0    NaN    NaN

In [4]:
pd.pivot_table(df,values = ['Sales','Units'] , index = 'Region' , columns = 'Product')

         Sales                      Units
Product      A      B      C      D     A     B     C     D
Region
East     627.0    NaN    NaN    NaN  59.2   NaN   NaN   NaN
North      NaN    NaN  715.8    NaN   NaN   NaN  51.4   NaN
South      NaN    NaN    NaN  784.6   NaN   NaN   NaN  61.0
West       NaN  601.0    NaN    NaN   NaN  53.4   NaN   NaN

### Crosstabs

In [5]:
 pd.crosstab(df['Region'],df['Product'])

Product  A  B  C  D
Region
East     5  0  0  0
North    0  0  5  0
South    0  0  0  5
West     0  5  0  0